       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDSAMPLE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'
           STOP RUN.