IDENTIFICATION DIVISION.
PROGRAM-ID. READ-NAME.
DATA DIVISION.
          FILE SECTION.
          WORKING-STORAGE SECTION.
          LINKAGE SECTION.
          LOCAL-STORAGE SECTION.
          
STOP